/*
 *******************************************************************************
 *	File name	:	Meas.c
 *
 *	[内容]
 *		測定処理
 *------------------------------------------------------------------------------
 *	[変更日]		[変更者]		[概要]
 *	2017.12.07		Softex N.I		新規作成
 *******************************************************************************
 */
#include "cpu_sfr.h"															/* SFR定義ヘッダー */

#include "typedef.h"															/* データ型定義 */
#include "switch.h"																/* コンパイルスイッチ定義 */
#include "func.h"																/* 関数の外部参照(extern)定義 */


/*
 *==============================================================================
 *	define定義
 *==============================================================================
 */
#define	P_TH_SENS		(P2_bit.no0)							/* サーミスタ計測 */
#define	P_TH_SENS_IO	(PM2_bit.no0)
#define	P_TH_REF		(P4_bit.no2)							/* 温度リファレンス計測 */
#define	P_TH_REF_IO		(PM4_bit.no2)
#define	P_TH_OUTSENS	(P2_bit.no1)							/* 外付けサーミスタ計測 */
#define	P_TH_OUTSENS_IO	(PM2_bit.no1)
#define	P_CMP_MODE		(PMC4_bit.no4)							/* コンパレターモードレジスタ */
#define	P_CMP_IO		(PM4_bit.no4)							/* 入出力 */
#define	P_CMP			(P4_bit.no4)							/* Hi/Lo */
#define	P_CMP_PULUP		(PU4_bit.no4)							/* プルアップ */
#define	P_CMP_OMOD		(POM4_bit.no4)							/* 出力モード */

#define	P_TH_DISCHRG	(P4_bit.no5)							/* 強制放電制御 */
#define	P_TH_DISCHRG_IO	(PM4_bit.no5)							/* 強制放電制御ポートIO */



/*
 *==============================================================================
 *	列挙型定義
 *==============================================================================
 */


/*
 *==============================================================================
 *	構造体定義
 *==============================================================================
 */


/*
 *==============================================================================
 *	変数定義
 *==============================================================================
 */


/*
 *==============================================================================
 *	定数定義
 *==============================================================================
 */


/*
 *==============================================================================
 *	プロトタイプ宣言
 *==============================================================================
 */



#pragma section text MY_APP2
/*
 *******************************************************************************
 *	測定処理 初期化処理
 *
 *	[内容]
 *		測定処理の初期化処理を行う。
 *******************************************************************************
 */
void ApiMeas_Initial( void )
{
	P_TH_SENS_IO = (uint8_t)imLow;												/* サーミスタ計測用ポート：出力 */
	P_TH_REF_IO = (uint8_t)imLow;												/* 温度リファレンス計測用ポート:出力 */
	P_TH_OUTSENS_IO = (uint8_t)imLow;											/* 外付けサーミスタポート:出力 */
	P_TH_SENS = (uint8_t)imHigh;												/* サーミスタ計測用ポート初期化 */
	P_TH_REF = (uint8_t)imHigh;													/* 温度リファレンス計測用ポート初期化 */
	P_TH_OUTSENS = (uint8_t)imHigh;												/* 外付けサーミスタポート初期化 */
	P_CMP_MODE = (uint8_t)imLow;												/* コンパレータポート：初期化(出力Lo) */
	P_CMP_IO = (uint8_t)imLow;
	P_CMP = (uint8_t)imLow;
	P_CMP_PULUP = (uint8_t)imLow;
	P_CMP_OMOD = (uint8_t)imLow;
}

#pragma section


