/*
 *******************************************************************************
 *	File name	:	typedef.h
 *
 *	[内容]
 *		データ型定義
 *
 *		MISRA-C:2004 ルール6.1、6.2、6.3 に対応
 *		<6.1> 単なる char 型は，
 *			文字データの格納及び使用に限って用いなければならない。
 *		<6.2> signed char 型及び unsigned char 型は，
 *			数値データの格納及び使用に限って用いなければならない。
 *		<6.3> 基本型の代わりに，
 *			サイズ及び符号属性(signedness)を示すtypedef を用いなければならない。
 *------------------------------------------------------------------------------
 *	[変更日]		[変更者]		[概要]
 *	2017.11.08		Softex N.I		新規作成
 *******************************************************************************
 */
#ifndef	INCLUDED_TYPEDEF_H
#define	INCLUDED_TYPEDEF_H


#include "r_cg_macrodriver.h"

/*
 *==============================================================================
 *	文字データ専用（処理系依存あり：符号有無は未定義）
 *==============================================================================
 */
typedef char					char_t;											/* 文字ﾃﾞｰﾀ専用 */

/*
 *==============================================================================
 *	数値データ専用（処理系依存なし）
 *==============================================================================
 */
typedef signed char				sint8_t;										/* 符号付き整数 8bit */
#if 0
typedef unsigned char			uint8_t;										/* 符号なし整数 8bit */
#endif

typedef signed short int		sint16_t;										/* 符号付き整数 16bit */
#if 0
typedef unsigned short int		uint16_t;										/* 符号なし整数 16bit */
#endif

typedef signed long int			sint32_t;										/* 符号付き整数 32bit */
#if 0
typedef unsigned long int		uint32_t;										/* 符号なし整数 32bit */
#endif


/*
 *==============================================================================
 *	数値データ専用（処理系依存あり）
 *==============================================================================
 */
typedef float					float_t;										/* float */
typedef double					double_t;										/* double */


typedef uint32_t				T_CLK_t;										/* クロック値を32ビット符号無しで定義 */


#endif																			/* INCLUDED_TYPEDEF_H */
